# Задание 1
# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

a = 3.6
b = 8
c = True
print(f"Целое цисло: {b}, Дробное число : {a}, Истина :{c}")
anek = input('Введите слово "анекдот" :')
print(f"Вот что вы ввели : {anek}")
print('А вот анекдот: Продавец шаурмы, меняя пелёнки своему ребёнку, по привычке добавил салат и майонез.')